# _ is <unk>
UNK = '_'
# @ is number
NUM = '@'
EOS = '#'

alph = ['ර', 'ණ', 'ව', 'ි', 'ස', 'ේ', 'ා', ' ', 'අ', 'ධ', 'ක', 'ය', '්', 'ෂ', 'ත', 'න', 'ො', 'ම', 'හ',
        'ල', 'ට', 'ී', 'බ', 'ජ', 'ළ', 'ඹ', 'ප', 'ු', 'ෘ', 'ග', 'ද', 'ැ', '\u200c', 'ෙ', 'භ', 'ඉ', '\u200d', 'ශ',
        'ඩ', 'ූ', 'ආ', 'ං', 'ෝ', 'ථ', 'ෞ', '"', 'ඒ', 'ඔ', 'ඇ', 'එ', 'ච', 'ඡ', 'ෛ', 'ඛ', 'උ', 'ෑ', 'ඳ', 'ඵ',
        'ඕ', 'ඨ', '\t', 'ඌ', 'ඥ', 'ඟ', 'ඊ', 'ෆ', "'", '“', '”', '‘', ':', '*', 'ඝ', 'ඬ', '&', 'ඤ', 'ඣ', 'ඓ',
        '\u200b', 'ඪ', '–', '@', '’', '\ufeff', 'ඍ', '=', '‚', ';', '?', '+', 'ෟ', 'ඖ', '_', 'ෲ', 'ඞ', '[', ']',
        '‟', '\uf0b7', '\uf02d', '{', '}', 'ඈ', '\uf0a7', '\uf076', '<', '\uf0b0', '„', '!', '`', '>', '$', '்', '˝',
        '\uf0d8', '\uf09e', '̓', '|', 'ෳ', '̀', '\xa0', '.', '#']
# depreciated
# Sinhala_alpha = [
#     "අ", "ආ", "ඇ", "ඈ", "ඉ", "ඊ", "උ", "ඌ", "එ", "ඒ", "ඓ", "ඔ", "ඕ", "ඖ", "ඍ", "ඎ", "ඏ", "ඐ", "ෘ", "ෲ",
#     "ෟ", "ෳ", "ක", "ඛ", "ග", "ඝ", "ඞ", "ඟ", "ච", "ඡ", "ජ", "ඣ", "ඤ", "ඥ", "ඦ", "ට", "ඨ", "ඩ", "ඪ", "ණ", "ඬ",
#     "ත", "ථ", "ද", "ධ", "න", "ඳ", "ප", "ඵ", "බ", "භ", "ම", "ඹ", "ය", "ර", "ල", "ළ", "ව", "හ", "ශ", "ෂ", "ස", "ෆ",
#     "ෙ", "ු", "ෛ", "්", "ූ", "ෝ", "ි", "ේ", "ැ", "ො", "ං", "ඃ", "ෞ", "ී", "ෑ", "ා", 'ෳ',
#
#     # '\u200d',  # ZERO WIDTH JOINER'
#     # '\u200c',  # ZERO WIDTH NON-JOINER (U+200C)
#     # '\u200b'  # ZEROS WITH SPACE
#
# ]

sinhala_unicode = {
    "ං"  : '\u0D82',
    "ඃ"  : '\u0D83',
    "අ"    : '\u0D85',
    "ආ"   : '\u0D86',
    "ඇ"   : '\u0D87',
    "ඈ"   : '\u0D88',
    "ඉ"   : '\u0D89',
    "ඊ"   : '\u0D8A',
    "උ"   : '\u0D8B',
    "ඌ"   : '\u0D8C',
    "ඍ"   : '\u0D8D',
    "ඎ"   : '\u0D8E',
    "ඏ"   : '\u0D8F',
    "ඐ"   : '\u0D90',
    "එ"   : '\u0D91',
    "ඒ"   : '\u0D92',
    "ඓ"   : '\u0D93',
    "ඔ"   : '\u0D94',
    "ඕ"   : '\u0D95',
    "ඖ"   : '\u0D96',
    "ක"   : '\u0D9A',
    "ඛ"   : '\u0D9B',
    "ග"   : '\u0D9C',
    "ඝ"   : '\u0D9D',
    "ඞ"   : '\u0D9E',
    "ඟ"   : '\u0D9F',
    "ච"   : '\u0DA0',
    "ඡ"   : '\u0DA1',
    "ජ"   : '\u0DA2',
    "ඣ"   : '\u0DA3',
    "ඤ"   : '\u0DA4',
    "ඥ"   : '\u0DA5',
    "ඦ"   : '\u0DA6',
    "ට"   : '\u0DA7',
    "ඨ"   : '\u0DA8',
    "ඩ"   : '\u0DA9',
    "ඪ"   : '\u0DAA',
    "ණ"   : '\u0DAB',
    "ඬ"   : '\u0DAC',
    "ත"   : '\u0DAD',
    "ථ"   : '\u0DAE',
    "ද"   : '\u0DAF',
    "ධ"   : '\u0DB0',
    "න"   : '\u0DB1',
    "ඳ"   : '\u0DB3',
    "ප"   : '\u0DB4',
    "ඵ"   : '\u0DB5',
    "බ"   : '\u0DB6',
    "භ"   : '\u0DB7',
    "ම"   : '\u0DB8',
    "ඹ"   : '\u0DB9',
    "ය"   : '\u0DBA',
    "ර"   : '\u0DBB',
    "ල"   : '\u0DBD',
    "ව"   : '\u0DC0',
    "ශ"   : '\u0DC1',
    "ෂ"   : '\u0DC2',
    "ස"   : '\u0DC3',
    "හ"   : '\u0DC4',
    "ළ"   : '\u0DC5',
    "ෆ"   : '\u0DC6',
    "්"   : '\u0DCA',
    "ා"   : '\u0DCF',
    "ැ"   : '\u0DD0',
    "ෑ"   : '\u0DD1',
    "ි"   : '\u0DD2',
    "ී"   : '\u0DD3',
    "ු"   : '\u0DD4',
    "ූ"   : '\u0DD6',
    "ෘ"   : '\u0DD8',
    "ෙ"   : '\u0DD9',
    "ේ"   : '\u0DDA',
    "ෛ"   : '\u0DDB',
    "ො"   : '\u0DDC',
    "ෝ"   : '\u0DDD',
    "ෞ"   : '\u0DDE',
    "ෟ"   : '\u0DDF',
    # "෦"   : '\u0DE6',
    # "෧"   : '\u0DE7',
    # "෨"   : '\u0DE8',
    # "෩"   : '\u0DE9',
    # "෪"   : '\u0DEA',
    # "෫"   : '\u0DEB',
    # "෬"   : '\u0DEC',
    # "෭"   : '\u0DED',
    # "෮"   : '\u0DEE',
    # "෯"   : '\u0DEF',
    # "ෲ"   : '\u0DF2',
    # "ෳ"   : '\u0DF3',
    # "෴"   : '\u0DF4',
}

Sinhala_alpha = list(sinhala_unicode.values())

# depciated
# vowel_symbols = [
#     "ා", "ැ", "ෑ", "ි", "ී", "ු", "ූ", "ෙ", "ේ",
#     "ෛ", "ො", "ෝ", "ෞ", "ෘ", "ෲ", "ෟ", "ෳ",
#     "ං", "ඃ", "්‍", "‍්‍ය", "‍්‍ර",
#     '\u200d',  # ZERO WIDTH JOINER'
#     '\u200c',  # ZERO WIDTH NON-JOINER (U+200C)
#     '\u200b'  # ZEROS WITH SPACE
# ]

vowel_symbols = {
    "ං"  : '\u0D82',
    "ඃ"  : '\u0D83',
    "්"   : '\u0DCA',
    "ා"   : '\u0DCF',
    "ැ"   : '\u0DD0',
    "ෑ"   : '\u0DD1',
    "ි"   : '\u0DD2',
    "ී"   : '\u0DD3',
    "ු"   : '\u0DD4',
    "ූ"   : '\u0DD6',
    "ෙ"   : '\u0DD9',
    "ේ"   : '\u0DDA',
    "ෛ"   : '\u0DDB',
    "ො"   : '\u0DDC',
    "ෝ"   : '\u0DDD',
    "ෞ"   : '\u0DDE',
    "ෟ"   : '\u0DDF',
    "ෘ"   : '\u0DD8',
    "ෲ"   : '\u0DF2',
    "ෳ"   : '\u0DF3',
    "‍්‍ය" : '\u0DCA\u200D\u0DBA',
    "‍්‍ර" : '\u0DCA\u200D\u0DBB',
    "ZWJ" : '\u200d' ,  # ZERO WIDTH JOINER'
    "ZWNJ" :'\u200c' ,  # ZERO WIDTH NON-JOINER (U+200C)
    "ZWS" :'\u200b'  # ZEROS WITH SPACE
}

# vowel_symbols = list(vowel_symbols.values())
symbols = ["'", '“', '”', '‘', ':', '*', '"', '–',
           '’', '=', '‚', ';', '?', '+', '̓', '|', '̀', '\xa0', '.',
           '#', '&', '[', ']', '‟', '{', '}', '!', '`', '>', '$', '(',
           ')',
           NUM,
           UNK,
           EOS,
           ]

# \ufeff - BYTE ORDER MARK
# uf09e